jmeter-lab05/plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <!-- ═══════════════════════════════════════════════════════════════
         TEST PLAN
         ═══════════════════════════════════════════════════════════ -->
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
              testname="Lab05 Exercise-A — 50 Users / 30s Ramp-Up"
              enabled="true">
      <stringProp name="TestPlan.comments">
        JMeter load test for the api.js proxy (cache + queue).
        Target: http://localhost:3000/posts  →  jsonplaceholder upstream.
        Thread Group: 50 virtual users, 30-second ramp-up, 1 loop.
      </stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables"
                   elementType="Arguments"
                   guiclass="ArgumentsPanel"
                   testclass="Arguments"
                   testname="User Defined Variables"
                   enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>

    <hashTree>
      <!-- ─── HTTP Request Defaults (shared config) ─────────────── -->
      <ConfigTestElement guiclass="HttpDefaultsGui"
                         testclass="ConfigTestElement"
                         testname="HTTP Request Defaults"
                         enabled="true">
        <elementProp name="HTTPsampler.Arguments"
                     elementType="Arguments"
                     guiclass="HTTPArgumentsPanel"
                     testclass="Arguments"
                     testname="User Defined Variables"
                     enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">localhost</stringProp>
        <stringProp name="HTTPSampler.port">3000</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
      </ConfigTestElement>
      <hashTree/>

      <!-- ─── HTTP Cache Manager (JMeter-side HTTP caching) ───────── -->
      <CacheManager guiclass="CacheManagerGui"
                    testclass="CacheManager"
                    testname="HTTP Cache Manager"
                    enabled="true">
        <boolProp name="clearEachIteration">false</boolProp>
        <boolProp name="useExpires">true</boolProp>
        <intProp name="maxSize">5000</intProp>
      </CacheManager>
      <hashTree/>

      <!-- ═══════════════════════════════════════════════════════════
           THREAD GROUP — 50 Users, 30-second ramp-up, 1 loop
           ═══════════════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui"
                   testclass="ThreadGroup"
                   testname="Thread Group — 50 Users"
                   enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller"
                     elementType="LoopController"
                     guiclass="LoopControlPanel"
                     testclass="LoopController"
                     testname="Loop Controller"
                     enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">1</intProp>
        </elementProp>
        <!-- 50 virtual users -->
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <!-- 30-second ramp-up -->
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>

      <hashTree>
        <!-- ─── HTTP Sampler 1: GET /posts ───────────────────────── -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui"
                          testclass="HTTPSamplerProxy"
                          testname="GET /posts (all)"
                          enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/posts</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Response Assertion: status code must be 200 -->
          <ResponseAssertion guiclass="AssertionGui"
                             testclass="ResponseAssertion"
                             testname="Assert HTTP 200"
                             enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="606">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected HTTP 200 OK</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="ResponseAssertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>

          <!-- Response Assertion: body must contain "userId" -->
          <ResponseAssertion guiclass="AssertionGui"
                             testclass="ResponseAssertion"
                             testname="Assert Body Contains userId"
                             enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1">userId</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Response body must contain &quot;userId&quot;</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="ResponseAssertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- ─── HTTP Sampler 2: GET /posts/1 (single post) ──────── -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui"
                          testclass="HTTPSamplerProxy"
                          testname="GET /posts/1 (single)"
                          enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/posts/1</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Response Assertion: status code must be 200 -->
          <ResponseAssertion guiclass="AssertionGui"
                             testclass="ResponseAssertion"
                             testname="Assert HTTP 200"
                             enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="606">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected HTTP 200 OK</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="ResponseAssertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>

          <!-- Response Assertion: body must contain "id" -->
          <ResponseAssertion guiclass="AssertionGui"
                             testclass="ResponseAssertion"
                             testname="Assert Body Contains id"
                             enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1">"id":1</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Response body must contain &quot;id&quot;:1</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="ResponseAssertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- ─── HTTP Sampler 3: GET /status (cache/queue stats) ─── -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui"
                          testclass="HTTPSamplerProxy"
                          testname="GET /status (server stats)"
                          enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/status</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui"
                             testclass="ResponseAssertion"
                             testname="Assert HTTP 200"
                             enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="606">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected HTTP 200 OK</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="ResponseAssertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>

          <ResponseAssertion guiclass="AssertionGui"
                             testclass="ResponseAssertion"
                             testname="Assert Body Contains cacheSize"
                             enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1">cacheSize</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Status body must contain cacheSize field</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="ResponseAssertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- ─── Summary Report Listener ──────────────────────────── -->
        <ResultCollector guiclass="SummaryReport"
                         testclass="ResultCollector"
                         testname="Summary Report"
                         enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <!-- results.jtl written here when run headlessly via -l flag -->
        </ResultCollector>
        <hashTree/>

        <!-- ─── View Results Tree (GUI inspection only) ───────────── -->
        <ResultCollector guiclass="ViewResultsFullVisualizer"
                         testclass="ResultCollector"
                         testname="View Results Tree"
                         enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>