jmeter-lab05/jmeter-report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.780000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 246.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 149.61000000000172,
    "throughput" : 5.113345832623147,
    "receivedKBytesPerSec" : 42.32332324867905,
    "sentKBytesPerSec" : 0.609207218339867
  },
  "GET /status (server stats)" : {
    "transaction" : "GET /status (server stats)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.46,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.7224155155189638,
    "receivedKBytesPerSec" : 0.427239786075993,
    "sentKBytesPerSec" : 0.20520966102862653
  },
  "GET /posts/1 (single)" : {
    "transaction" : "GET /posts/1 (single)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.54,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 57.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 57.0,
    "throughput" : 1.7190991920233798,
    "receivedKBytesPerSec" : 0.7790003975416881,
    "sentKBytesPerSec" : 0.2064933599793708
  },
  "GET /posts (all)" : {
    "transaction" : "GET /posts (all)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.340000000000002,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 246.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 246.0,
    "throughput" : 1.7045067157564602,
    "receivedKBytesPerSec" : 41.12958059546942,
    "sentKBytesPerSec" : 0.2014114380923161
  }
}